%% MATLAB|中的高维数组|
%% |*（|1|）创建多维数组*|

ones(3,4)
x1 = zeros(2,4,3)
randi([1,10],3,4)
x2 = randi([1,10],3,4,2)
randi([1,10],3,4,3,2)
%%
size(x2)
numel(x2)
length(x2)
size(ones(5,6,10))
size(ones(5,6,10),3)  
%%
x2 = [6 4 1 8;1 9 2 7;3 1 7 5]
x2(:,:,2) = [6 2 4 1;3 7 7 10;8 2 8 8]
%%
x = [1 2]
x(2,3) = 10
%%
x2 = [6 4 1 8;1 9 2 7;3 1 7 5]
x2(:,:,3) = [6 2 4 1;3 7 7 10;8 2 8 8]
%%
x2 = [6 4 1 8;1 9 2 7;3 1 7 5]
x2(2,3,3) = 11
%%
x3 = reshape(1:12,3,4)
x3(2,3,3) = 666
%%
x = [6 3 9 1 7 7 6 8 7 4 8 10;
     1 4 1 2 8 5 3 2 2 7 1 8];
x2 = reshape(x,3,4,2)
%%
x = [6 3 9 1 7 7 6 8 7 4 8 10;
     1 4 1 2 8 5 3 2 2 7 1 8];
reshape(x,3,[],2)
%%
x = [6 3 9 1 7 7 6 8 7 4 8 10;
     1 4 1 2 8 5 3 2 2 7 1 8];
reshape(x,2,4,[])
%%
x2(:)
%%
cat(1,[2,3],[4,5])
cat(2,[2,3],[4,5])
cat(3,[2,3],[4,5])
c1 = [6 4 1 8;1 9 2 7;3 1 7 5];
c2 = [6 2 4 1;3 7 7 10;8 2 8 8];
cat(3,c1,c2)
%% 
% 下面这个例题需要元胞数组的知识
% 
% 等学完了MATLAB入门课程的第五章就能看懂了
% 
% <https://www.bilibili.com/video/BV1dN4y1Q7Kt https://www.bilibili.com/video/BV1dN4y1Q7Kt>
% 
% 
%%
d = randi(100,30*6,3)
r = ones(1,6) * 30
c = 3;
C = mat2cell(d,r,c)
C{:}
CC = cat(3,C{:});
CC
size(CC)
mean(CC,1)
mean(CC,3)  % dim = 3
%% 
% 读取图片数据
%%
pt = imread('peppers.png')  % im来自image
%% 
% uint8代表无符号八位整数，表示的数值范围是0到255
% 
% 红（Red）、绿（Green）和蓝（Blue）的范围也是0-255
% 
% RGB全为0时表示黑色，RGB全为255表示白色

imshow(pt)
%% |（|2|）引用高维数组|
%%
x = [6 4 1 8;1 9 2 7;3 1 7 5];
x(:,:,2) = [6 2 4 1;3 7 7 10;8 2 8 8];
x
% 引用第二行、第四列、第二页的元素
x(2,4,2)
% 引用第二行、第四列的元素（故意不指定页索引）
x(2,4)  %  MATLAB会默认返回第一页（第一个切片）中对应位置的元素。
% 引用二三两行、一四两列、一二页的元素
x(2:3,[1,4],1:2)
% 引用每一行、倒数第二列、最后一页的元素
x(:,end-1,end)
% 将x中的所有元素按照线性索引的顺序重构成一个列向量
x(:)
% 线性索引为1、11和21号位置的元素
x([1,11,21])
x(6:6:end)
%% |（|3|）修改和删除高维数组|
%%
x = [6 4 1 8;1 9 2 7;3 1 7 5];
x(:,:,2) = [6 2 4 1;3 7 7 10;8 2 8 8];
y = x;
y(:,2,1) = [1 3 8]
%%
y = x;
cat(3,[1 3 8],[0 1 5]) 
y(:,2,:)
y(:,2,:) = cat(3,[1 3 8],[0 1 5])  % 左侧大小是3×1×2，右侧大小是1×3×2
%%
y = x;
y(:,2,:) = 8  
%%
y = x;
% y(:,2,:) = [1 3 8]
%%
y = x;
% y(:,2,:) = [1 3 8]'
%%
x = [1 2 3;
    4 5 6;
    7 8 9];
 x(:,[1,2])
 [6;8;10] 
 % x(:,[1,2]) = [6;8;10] 
%%
x(:,[1,2])
 x(:,[1,2]) + [6;8;10]
%%
x = [6 4 1 8;1 9 2 7;3 1 7 5];
x(:,:,2) = [6 2 4 1;3 7 7 10;8 2 8 8];
x
%%
y = x;
y(:,2,:) = []  
%%
% y = x;
% y(:,2,1) = [] 
%%
y = x;
y(:,:,1) = []
%%
x = [6 4 1 8;1 9 2 7;3 1 7 5];
x(:,:,2) = [6 2 4 1;3 7 7 10;8 2 8 8]
y = x;
% 删除线性索引是2或者3的倍数对应位置的元素
ind = unique([2:2:numel(y),3:3:numel(y)])
y(ind) = []  % 使用线性索引删除时，结果会返回一个行向量
%% |（|4|）高维数组中与维度相关的三个函数|
%%
ndims(1:10)
ndims([1 2 3; 4 5 6])
x = ones(2,3,4);
ndims(x)
size(x)
length(size(x))
y1 = ones(2,1,2)
squeeze(y1)
y2 = zeros(1,3,2)
squeeze(y2)
%%
x = [1, 2, 3;
    4, 5, 6];
permute(x,[2,1])
permute(x,[1,2])
y = cat(3,[1,2,3;4,5,6],[7,8,9;10,11,12])
permute(y,[2,1,3])
% y'
% 下面两个函数在MATLAB2020b推出
% pagectranspose(y)
% pagectranspose(1+3i)
pagetranspose(1+3i)
(1+3i).'
(1+3i)'
%% 
% x表示4名同学、三门科目、两个学期的成绩评分
%%
x = [6 4 3;1 9 2;3 1 7;5 6 7];
x(:,:,2) = [3 2 4;3 5 7;8 2 4; 3 7 7];
x
size(x)
y1 = permute(x,[3,2,1])
y2 = permute(x,[3,1,2])
%% |（|5|）调用函数对高维数组进行计算|
%%
x = [6 4 1 8;1 9 2 7;3 1 7 5];
x(:,:,2) = [6 2 4 1;3 7 7 10;8 2 8 8];
s = sum(x)  % 等价于sum(x,1) 即沿着第一个维度计算
size(s)
squeeze(s)
sum(x,2)
sum(x,3)
sum(x(:))  % 计算三维数组中所有元素的和
% 也可以使用三次sum函数计算：
sum(sum(sum(x)))
%% 
% |只能使用MATLAB2018b以及之后的版本才能运行，下同|
%%
% sum(x,"all") 
% sum(x,[1,2]) % 对第一维度和第二维度上的所有元素求和（即对x的每个页中的所有元素求和）
% sum(x,[1,3]) % 对第一维度和第三维度上的所有元素求和
% sum(x,[2,3]) % 对第二维度和第三维度上的所有元素求和
% sum(x,[1 2 3]) % 所有元素的和
%% |（|6|）高维数组的算术运算和关系运算|
%%
x = [6 4 1 8;1 9 2 7;3 1 7 5];
x(:,:,2) = [6 2 4 1;3 7 7 10;8 2 8 8];
x
x + [1 2 3 4]
x .* [1;2;3]
c = [1 1 1 1;
    2 2 2 2;
    3 3 3 3];
x .^ c
x >= 5
(x >= 3) & (x <= 6)